Catalogs/ПриложенияКДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПриложенияКДоговорам</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнутреннийЗапасВНеделях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отказ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокМонтажаВНеделях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОкончанияМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОкончанияПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОкончанияПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПроектированияВНеделях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПроизводстваВНеделях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьАвтор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИзделияЗаказчика</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИзделиеЗаказчика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИзделияЗаказчика</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УслугиПриложенияДоговора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УслугаПриложенияДоговора</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УслугиПриложенияДоговора</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/АктуальныеИзделияКомплектыЭлементы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>АктуальныеИзделияКомплектыЭлементы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИзделиеКомплектЭлемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияЭлемент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДанныеИзделияЗаказчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеИзделияЗаказчика</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеСАртикулом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИзделиеЗаказчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияЗаказчика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИтогоПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИтогоПроекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИзделияЗаказчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияЗаказчика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОконачаниеДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОконачаниеДоговора</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОкончаниеПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеМонтаж</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеСЗапасом</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИзделияКомплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ОбъектыЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ОбъектыЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВедущийКонструктор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнитьКартуПроектаДиз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнитьКартуПроектаКон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполнениеДлительностиПроизводства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполненияДлительностиМонтажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодготовитьОзнакомительныйВыезд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроверятьГабаритныеЧерчежи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководительЗамера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьЗапускВРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьКартуПроектаДиз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьКартуПроектаКон</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПриложенияКДоговорам/Ext/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	
	Если НЕ ЭтоГруппа Тогда
		ЗаполнитьИтогоСделка();
		ЗаполнитьДатыОкончания();
		УстановитьАктуальность();
		ПроверкаСозданиеЗадачи();
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьАктуальность()
	НаборЗаписей = РегистрыСведений.АктуальныеИзделияКомплектыЭлементы.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПриложениеКДоговору.Установить(Ссылка);
	
    НаборЗаписей.Записать();
	
	мИзделияЗаказчика = ИзделияЗаказчика.ВыгрузитьКолонку("ИзделиеЗаказчика");
	
	
	
	Для каждого х Из мИзделияЗаказчика Цикл
		МенеджерЗаписи = РегистрыСведений.ДанныеИзделияЗаказчика.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИзделиеЗаказчика = х;
		МенеджерЗаписи.Прочитать();
		
		МенеджерЗаписи.Актуальность = Истина;
		
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияЗаказчикаИзделияЭлемент.ИзделиеЭлемент КАК ИзделиеЭлемент
		|ИЗ
		|	Справочник.ИзделияЗаказчика.ИзделияЭлемент КАК ИзделияЗаказчикаИзделияЭлемент
		|ГДЕ
		|	ИзделияЗаказчикаИзделияЭлемент.Ссылка В(&мИзделияЗаказчика)";
	
	Запрос.УстановитьПараметр("мИзделияЗаказчика", мИзделияЗаказчика);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
    мИзделияЭлемент = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписей = РегистрыСведений.АктуальныеИзделияКомплектыЭлементы.СоздатьМенеджерЗаписи();
		МенеджерЗаписей.ПриложениеКДоговору 	= Ссылка;
		МенеджерЗаписей.ИзделиеКомплектЭлемент 	= Выборка.ИзделиеЭлемент;
		МенеджерЗаписей.Записать();
		
		мИзделияЭлемент.Добавить(Выборка.ИзделиеЭлемент);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплект.Ссылка КАК ИзделиеКомплект
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|ГДЕ
		|	ИзделияКомплект.ИзделияЭлемент.ИзделиеЭлемент В(&мИзделияЭлемент)
		|
		|СГРУППИРОВАТЬ ПО
		|	ИзделияКомплект.Ссылка";
	
	Запрос.УстановитьПараметр("мИзделияЭлемент", мИзделияЭлемент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписей = РегистрыСведений.АктуальныеИзделияКомплектыЭлементы.СоздатьМенеджерЗаписи();
		МенеджерЗаписей.ПриложениеКДоговору 	= Ссылка;
		МенеджерЗаписей.ИзделиеКомплектЭлемент 	= Выборка.ИзделиеКомплект;
		МенеджерЗаписей.Записать();
		
		мИзделияЭлемент.Добавить(Выборка.ИзделиеКомплект);
	КонецЦикла;
	

КонецПроцедуры // УстановитьАктуальность()

Процедура ЗаполнитьИтогоСделка()

	НаборЗаписей = РегистрыСведений.ИтогоПроекта.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Договор.Установить(Ссылка);
	
	НаборЗаписей.Записать();
	
	Знак = ?(Отказ, -1, 1);
	
	НаборЗаписей = РегистрыСведений.ИтогоПроекта.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Договор.Установить(Ссылка);
	НаборЗаписей.Отбор.Проект.Установить(Проект);
		
	Для каждого х Из ИзделияЗаказчика Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Договор 		 = Ссылка;
		НоваяЗапись.Проект  		 = Проект;
		НоваяЗапись.ИзделияЗаказчика = х.ИзделиеЗаказчика;
		НоваяЗапись.Количество 		 = Знак * х.ИзделиеЗаказчика.Количество;
	КонецЦикла;
	
	НаборЗаписей.Записать();

КонецПроцедуры // ЗаполнитьИтогоСделка()

Процедура ПередЗаписью(Отказ)
	Если НЕ ЭтоГруппа Тогда
		Родитель = омКонтрольПапки.КонтрольПапкиЭлементаСправочника(Проект, Ссылка.Метаданные().Имя); 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриложенияКДоговорамИзделияЗаказчика.ИзделиеЗаказчика КАК ИзделиеЗаказчика
		|ИЗ
		|	Справочник.ПриложенияКДоговорам.ИзделияЗаказчика КАК ПриложенияКДоговорамИзделияЗаказчика
		|ГДЕ
		|	ПриложенияКДоговорамИзделияЗаказчика.Ссылка = &Ссылка
		|	И НЕ ПриложенияКДоговорамИзделияЗаказчика.ИзделиеЗаказчика В (&ИзделиеЗаказчика)";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("ИзделиеЗаказчика", ИзделияЗаказчика.ВыгрузитьКолонку("ИзделиеЗаказчика"));
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			МенеджерЗаписи = РегистрыСведений.ДанныеИзделияЗаказчика.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.ИзделиеЗаказчика = Выборка.ИзделиеЗаказчика;
			МенеджерЗаписи.Прочитать();
			
			МенеджерЗаписи.Актуальность = Ложь;
			
			МенеджерЗаписи.Записать();

		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьДатыОкончания()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛОЖЬ КАК Обработан,
		|	ОконачаниеДоговора.ИзделияКомплект КАК ИзделияКомплект,
		|	ОконачаниеДоговора.Период КАК Период,
		|	ОконачаниеДоговора.ОкончаниеПроизводства КАК ОкончаниеПроизводства,
		|	ОконачаниеДоговора.ОкончаниеМонтаж КАК ОкончаниеМонтаж,
		|	ОконачаниеДоговора.ОкончаниеСЗапасом КАК ОкончаниеСЗапасом
		|ИЗ
		|	РегистрСведений.ОконачаниеДоговора КАК ОконачаниеДоговора
		|ГДЕ
		|	ОконачаниеДоговора.ПриложениеКДоговору = &ПриложениеКДоговору
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИзделияКомплектИзделияЭлемент.Ссылка КАК ИзделияКомплект,
		|	ИзделияЗаказчикаИзделияЭлемент.Ссылка КАК ИзделияЗаказчика
		|ИЗ
		|	Справочник.ИзделияЗаказчика.ИзделияЭлемент КАК ИзделияЗаказчикаИзделияЭлемент
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИзделияКомплект.ИзделияЭлемент КАК ИзделияКомплектИзделияЭлемент
		|		ПО ИзделияЗаказчикаИзделияЭлемент.ИзделиеЭлемент = ИзделияКомплектИзделияЭлемент.ИзделиеЭлемент
		|ГДЕ
		|	ИзделияЗаказчикаИзделияЭлемент.Ссылка В(&Ссылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ИзделияКомплектИзделияЭлемент.Ссылка,
		|	ИзделияЗаказчикаИзделияЭлемент.Ссылка";
	
	Запрос.УстановитьПараметр("ПриложениеКДоговору", Ссылка);
	Запрос.УстановитьПараметр("Ссылка", ИзделияЗаказчика.ВыгрузитьКолонку("ИзделиеЗаказчика"));
	
	ПакетВыгрузки = Запрос.ВыполнитьПакет();
	тзТекущиеКомплекты = ПакетВыгрузки[0].Выгрузить();
	тзТекущиеКомплекты.Индексы.Добавить("ИзделияКомплект");
	
	тзИзделияКомплект = ПакетВыгрузки[1].Выгрузить();
	тзИзделияКомплект.Индексы.Добавить("ИзделияЗаказчика");

	
	СекундВНеделе = 24 * 7 * 3600;
	
	ОкончаниеПроизводства 	= ДатаДоговора 			+ СрокПроизводстваВНеделях 	* СекундВНеделе;
	ОкончаниеМонтаж 		= ОкончаниеПроизводства + СрокМонтажаВНеделях 		* СекундВНеделе;
	ОкончаниеСЗапасом 		= ОкончаниеМонтаж 		+ ВнутреннийЗапасВНеделях 	* СекундВНеделе;
	
	
	стОтбор = Новый Структура("ИзделияЗаказчика", );
	Для каждого строкаИзделиеЗаказчика Из ИзделияЗаказчика Цикл
		стОтбор.ИзделияЗаказчика = строкаИзделиеЗаказчика.ИзделиеЗаказчика;
		НайденыеСтроки = тзИзделияКомплект.НайтиСтроки(стОтбор);
		
		Для каждого х Из НайденыеСтроки Цикл
			
			НайденаяСтрока = тзТекущиеКомплекты.Найти(х.ИзделияКомплект,"ИзделияКомплект");
			
			Если НЕ НайденаяСтрока = Неопределено Тогда
				НайденаяСтрока.Обработан = Истина;
				Если НайденаяСтрока.ОкончаниеПроизводства = ОкончаниеПроизводства 
					И НайденаяСтрока.ОкончаниеСЗапасом = ОкончаниеСЗапасом 
					И НайденаяСтрока.ОкончаниеМонтаж = ОкончаниеМонтаж 
					И НайденаяСтрока.Период = ДатаДоговора Тогда
					
					Продолжить;
				КонецЕсли;
				
			КонецЕсли;
			
			НаборЗаписей = РегистрыСведений.ОконачаниеДоговора.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ИзделияКомплект.Установить(х.ИзделияКомплект);
			НаборЗаписей.Отбор.Период.Установить(ДатаДоговора);
			
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.ИзделияКомплект 		= х.ИзделияКомплект;
			НоваяЗапись.Период 					= ДатаДоговора;
			НоваяЗапись.ОкончаниеПроизводства 	= ОкончаниеПроизводства; 
			НоваяЗапись.ОкончаниеМонтаж 		= ОкончаниеМонтаж; 
			НоваяЗапись.ОкончаниеСЗапасом 		= ОкончаниеСЗапасом; 
			НоваяЗапись.ПриложениеКДоговору 	= Ссылка;
			
			НаборЗаписей.Записать();
			
		КонецЦикла;
		
	КонецЦикла;
	
	стОтбор = Новый Структура("Обработан", Ложь);
	
	НайденыеСтроки = тзТекущиеКомплекты.НайтиСтроки(стОтбор);
	
	Для каждого х Из НайденыеСтроки Цикл
		НаборЗаписей = РегистрыСведений.ОконачаниеДоговора.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИзделияКомплект.Установить(х.ИзделияКомплект);
		НаборЗаписей.Отбор.Период.Установить(ДатаДоговора);
		
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьДатыОкончания()

Процедура ПроверкаСозданиеЗадачи()

	Если ПодписьДата = Дата(1, 1, 1) Тогда
	
		Возврат;	
	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодготовкаПроекта.Ссылка КАК Ссылка
		|ИЗ
		|	Задача.ПодготовкаПроекта КАК ПодготовкаПроекта
		|ГДЕ
		|	ПодготовкаПроекта.Назначение = &Назначение";
	
	Запрос.УстановитьПараметр("Назначение", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		Возврат;	
	КонецЕсли;
	
	Если НомерПоПорядку = 1 Тогда
		ТипЗадачи = ПредопределенноеЗначение("Перечисление.ОбъектыЗадач.СоздатьКартуПроектаДиз");	
		
		стПараметры = Задачи.ПодготовкаПроекта.ПолучитьСтруктуруДляСозданияЗадачи(Ссылка, Перечисления.ОбъектыЗадач.ПодготовитьОзнакомительныйВыезд, Ссылка);
		Задачи.ПодготовкаПроекта.СоздатьЗадачуПоПараметрам(стПараметры);
		
	Иначе
		ТипЗадачи = ПредопределенноеЗначение("Перечисление.ОбъектыЗадач.ДополнитьКартуПроектаДиз");	
	КонецЕсли;
	
	стПараметры = Задачи.ПодготовкаПроекта.ПолучитьСтруктуруДляСозданияЗадачи(Ссылка, ТипЗадачи, Ссылка);
	Задачи.ПодготовкаПроекта.СоздатьЗадачуПоПараметрам(стПараметры);
	

КонецПроцедуры
